app/controllers/api/futons_controller.rb

  def index()

    futons = bounds ? Futon.in_bounds(bounds) : Futon.all
---
SELECT "futons".* FROM "futons"

  def show()
    @futon = Futon.find(params[:id])
---
SELECT  "futons".* FROM "futons" WHERE "futons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @futon = Futon.find(params[:id])
---
SELECT  "futons".* FROM "futons" WHERE "futons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]