app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index()
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show()
    @user = User.find(params[:id])

INSERT INTO "users" ("firstname", "lastname", "password_digest", "session_token", "email", "profile_img_url", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    p @user
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "firstname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "tFwfv9HwF1XZW+8NARYO9A=="], ["firstname", "Edwardasdf"], ["updated_at", 2016-09-05 18:06:28 UTC], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user.update(user_params )